cross-symbol-checker.sh
# Check for date:1 ends here

# Get the alias previous and withdrawn symbols


# [[file:cross-symbol-checker.org::*Get the alias previous and withdrawn symbols][Get the alias previous and withdrawn symbols:1]]
get_alias_prev_withdrawn() {
start=$(date +%s)

unset alias
alias=$(zcat -f $DATADIR/alias.gz | awk -F "\t" -v symbol=$approved_symbol '$2==symbol {print}')
if [ -z "$alias" ]; then
    # Symbol is not in alias or not a valid symbol
    log "INFO" "$approved_symbol has no alias symbol."
else
    # Symbol is in alias symbols list.
    alias_symbols="$(echo "$alias" | cut -f 1 | sed 's/^/ALIAS\t/')"
    echo "$alias_symbols"
fi

unset prev
prev=$(zcat -f $DATADIR/prev.gz | awk -F "\t" -v symbol=$approved_symbol '$2==symbol {print}')
if [ -z "$prev" ]; then
    log "INFO" "$approved_symbol has no prev symbol."
else
    prev_symbols="$(echo "$prev" | cut -f 1 | sed 's/^/PREV\t/')"
    echo "$prev_symbols"
fi

unset withdrawn
withdrawn=$(zcat -f $DATADIR/withdrawn.gz | (grep "|$approved_symbol|" || true))
if [ -z "$withdrawn" ]; then
    log "INFO" "$approved_symbol has no withdrawn symbol."
else
    withdrawn_symbols="$(echo "$withdrawn" | cut -f 3 | sed 's/^/WITHDRAWN\t/')"
    echo "$withdrawn_symbols"
fi

end=$(date +%s)
runtime=$((end - start))
log "DEBUG" "TIME Checking for other symbols took $runtime seconds"
}
# Get the alias previous and withdrawn symbols:1 ends here

# Check symbol in annotation sources


# [[file:cross-symbol-checker.org::*Check symbol in annotation sources][Check symbol in annotation sources:1]]
check_annotation_sources() {
    start=$(date +%s)

    table=""
    if [ -z "$approved_symbol" ]; then
        log "INFO" "no approved symbol found so not checking annotation sources for approved symbol."
    else
        while read -r source assembly version target_file; do
            # Print out gff meta data
            source_info=$(zcat -f "$target_file" | grep -m 3 '^#!' | sed "s/^#!/VERSION $source $assembly /")
            echo "$source_info" | while read -r line; do log "INFO" "$line"; done
            echo "$source_info"

            # Get the non canonical chromosomes
            if [ "$assembly" != "T2T" ]; then
                case "$source" in
                    "RefSeq")
                        noncanonical=$(zcat -f "$target_file" | grep -v "^#" | awk -F"\t" '{print $1}' | sort -u | grep -v '^NC');
                        ;;
                    "Ensembl")
                        noncanonical=$(zcat -f "$target_file" | grep -v '^#' | awk -F"\t" '{print $1}' | sort -u | grep -vE 'chr([1-9]|1[0-9]|2[0-2]|X|Y|MT)');
                        ;;
                esac
            fi

            while read -r status new_symbol; do
                start_inner=$(date +%s%N)
                if [ -n "${status-}" ]; then
                    match=$(zcat -f "$target_file" | (grep -m1 -w "$new_symbol" || true))
                    if [ -z "${match:-}" ]; then
                        log "INFO" "$status SYMBOL $new_symbol found in $source $assembly $version"
                        table=""$table"Absent\t$symbol\t$approved_symbol\t$new_symbol\t$status\t$source\t$assembly\t$version\n"
                    else
                        # check_noncanonical
                        for contig in $(echo "${noncanonical-}"); do
                            if echo "$match" | grep -q "$contig"; then
                                log "WARN" "Symbol $new_symbol not in a canonical chromosome in $source $assembly $version"
                                echo "WARNING Symbol $new_symbol not in a canonical chromosome in $source $assembly $version"
                            fi
                        done

                        log "INFO" "$status SYMBOL $new_symbol not found in $source $assembly $version"
                        table=""$table"Present\t$symbol\t$approved_symbol\t$new_symbol\t$status\t$source\t$assembly\t$version\t$match\n"
                    fi
                fi
                end_inner=$(date +%s%N)
                runtime_inner=$(( (end_inner - start_inner) / 1000000 ))
                log "DEBUG" "TIME Checking $target_file for symbol $new_symbol took $runtime_inner milliseconds"
            done <<-EOF
$(echo "$approved_symbol"| sed 's/^/APPROVED\t/')
${prev_symbols-}
${alias_symbols-}
${withdrawn_symbols-}
EOF
        done <<-EOF
$(echo ${targets-} | sed '/^$/d')
EOF
    fi

    end=$(date +%s)
    runtime=$((end - start))
    log "DEBUG" "TIME Checking annotation sources took $runtime seconds"
    table=$(echo "$table" | sed '/^$/d;s/^/TABLE\t/')
}
